apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_xbar.h
/****************************************************************************
 * arch/arm/src/imxrt/hardware/rt117x/imxrt117x_xbar.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_XBAR_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_XBAR_H

/* XBAR Defines for IMXRT117X */

#define IMXRT_XBAR_SEL_MASKS {0xff, 0x7f, 0x7f}  /* The select masks A, B2, B3 */

/* XBARA1 Mux Inputs (I values) *********************************************/

#define IMXRT_XBARA1_IN_LOGIC_LOW                            IMXRT_XBARA1(XBAR_INPUT, 0)      /* LOGIC_LOW output assigned to XBARA1_IN0 input. */
#define IMXRT_XBARA1_IN_LOGIC_HIGH                           IMXRT_XBARA1(XBAR_INPUT, 1)      /* LOGIC_HIGH output assigned to XBARA1_IN1 input. */
#define IMXRT_XBARA1_IN_GND2                                 IMXRT_XBARA1(XBAR_INPUT, 2)      /* GND assigned to XBARA1_IN2 input. */
#define IMXRT_XBARA1_IN_GND3                                 IMXRT_XBARA1(XBAR_INPUT, 3)      /* GND assigned to XBARA1_IN3 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO04                      IMXRT_XBARA1(XBAR_INPUT, 4)      /* IOMUX_XBAR_INOUT04 output assigned to XBARA1_IN4 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO05                      IMXRT_XBARA1(XBAR_INPUT, 5)      /* IOMUX_XBAR_INOUT05 output assigned to XBARA1_IN5 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO06                      IMXRT_XBARA1(XBAR_INPUT, 6)      /* IOMUX_XBAR_INOUT06 output assigned to XBARA1_IN6 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO07                      IMXRT_XBARA1(XBAR_INPUT, 7)      /* IOMUX_XBAR_INOUT07 output assigned to XBARA1_IN7 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO08                      IMXRT_XBARA1(XBAR_INPUT, 8)      /* IOMUX_XBAR_INOUT08 output assigned to XBARA1_IN8 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO09                      IMXRT_XBARA1(XBAR_INPUT, 9)      /* IOMUX_XBAR_INOUT09 output assigned to XBARA1_IN9 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO10                      IMXRT_XBARA1(XBAR_INPUT, 10)     /* IOMUX_XBAR_INOUT10 output assigned to XBARA1_IN10 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO11                      IMXRT_XBARA1(XBAR_INPUT, 11)     /* IOMUX_XBAR_INOUT11 output assigned to XBARA1_IN11 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO12                      IMXRT_XBARA1(XBAR_INPUT, 12)     /* IOMUX_XBAR_INOUT12 output assigned to XBARA1_IN12 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO13                      IMXRT_XBARA1(XBAR_INPUT, 13)     /* IOMUX_XBAR_INOUT13 output assigned to XBARA1_IN13 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO14                      IMXRT_XBARA1(XBAR_INPUT, 14)     /* IOMUX_XBAR_INOUT14 output assigned to XBARA1_IN14 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO15                      IMXRT_XBARA1(XBAR_INPUT, 15)     /* IOMUX_XBAR_INOUT15 output assigned to XBARA1_IN15 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO16                      IMXRT_XBARA1(XBAR_INPUT, 16)     /* IOMUX_XBAR_INOUT16 output assigned to XBARA1_IN16 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO17                      IMXRT_XBARA1(XBAR_INPUT, 17)     /* IOMUX_XBAR_INOUT17 output assigned to XBARA1_IN17 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO18                      IMXRT_XBARA1(XBAR_INPUT, 18)     /* IOMUX_XBAR_INOUT18 output assigned to XBARA1_IN18 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO19                      IMXRT_XBARA1(XBAR_INPUT, 19)     /* IOMUX_XBAR_INOUT19 output assigned to XBARA1_IN19 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN20                      IMXRT_XBARA1(XBAR_INPUT, 20)     /* IOMUX_XBAR_INOUT20 output assigned to XBARA1_IN20 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN21                      IMXRT_XBARA1(XBAR_INPUT, 21)     /* IOMUX_XBAR_INOUT21 output assigned to XBARA1_IN21 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN22                      IMXRT_XBARA1(XBAR_INPUT, 22)     /* IOMUX_XBAR_INOUT22 output assigned to XBARA1_IN22 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN23                      IMXRT_XBARA1(XBAR_INPUT, 23)     /* IOMUX_XBAR_INOUT23 output assigned to XBARA1_IN23 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN24                      IMXRT_XBARA1(XBAR_INPUT, 24)     /* IOMUX_XBAR_INOUT24 output assigned to XBARA1_IN24 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN25                      IMXRT_XBARA1(XBAR_INPUT, 25)     /* IOMUX_XBAR_INOUT25 output assigned to XBARA1_IN25 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN26                      IMXRT_XBARA1(XBAR_INPUT, 26)     /* IOMUX_XBAR_INOUT26 output assigned to XBARA1_IN26 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN27                      IMXRT_XBARA1(XBAR_INPUT, 27)     /* IOMUX_XBAR_INOUT27 output assigned to XBARA1_IN27 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN28                      IMXRT_XBARA1(XBAR_INPUT, 28)     /* IOMUX_XBAR_INOUT28 output assigned to XBARA1_IN28 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN29                      IMXRT_XBARA1(XBAR_INPUT, 29)     /* IOMUX_XBAR_INOUT29 output assigned to XBARA1_IN29 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN30                      IMXRT_XBARA1(XBAR_INPUT, 30)     /* IOMUX_XBAR_INOUT30 output assigned to XBARA1_IN30 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN31                      IMXRT_XBARA1(XBAR_INPUT, 31)     /* IOMUX_XBAR_INOUT31 output assigned to XBARA1_IN31 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN32                      IMXRT_XBARA1(XBAR_INPUT, 32)     /* IOMUX_XBAR_INOUT32 output assigned to XBARA1_IN32 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN33                      IMXRT_XBARA1(XBAR_INPUT, 33)     /* IOMUX_XBAR_INOUT33 output assigned to XBARA1_IN33 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN34                      IMXRT_XBARA1(XBAR_INPUT, 34)     /* IOMUX_XBAR_INOUT34 output assigned to XBARA1_IN34 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN35                      IMXRT_XBARA1(XBAR_INPUT, 35)     /* IOMUX_XBAR_INOUT35 output assigned to XBARA1_IN35 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN36                      IMXRT_XBARA1(XBAR_INPUT, 36)     /* IOMUX_XBAR_INOUT36 output assigned to XBARA1_IN36 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN37                      IMXRT_XBARA1(XBAR_INPUT, 37)     /* IOMUX_XBAR_INOUT37 output assigned to XBARA1_IN37 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN38                      IMXRT_XBARA1(XBAR_INPUT, 38)     /* IOMUX_XBAR_INOUT38 output assigned to XBARA1_IN38 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN39                      IMXRT_XBARA1(XBAR_INPUT, 39)     /* IOMUX_XBAR_INOUT39 output assigned to XBARA1_IN39 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IN40                      IMXRT_XBARA1(XBAR_INPUT, 40)     /* IOMUX_XBAR_INOUT40 output assigned to XBARA1_IN40 input. */
#define IMXRT_XBARA1_IN_GND41                                IMXRT_XBARA1(XBAR_INPUT, 41)     /* GND assigned to XBARA1_IN41 input. */
#define IMXRT_XBARA1_IN_ACMP1_OUT                            IMXRT_XBARA1(XBAR_INPUT, 42)     /* ACMP1_OUT output assigned to XBARA1_IN42 input. */
#define IMXRT_XBARA1_IN_ACMP2_OUT                            IMXRT_XBARA1(XBAR_INPUT, 43)     /* ACMP2_OUT output assigned to XBARA1_IN43 input. */
#define IMXRT_XBARA1_IN_ACMP3_OUT                            IMXRT_XBARA1(XBAR_INPUT, 44)     /* ACMP3_OUT output assigned to XBARA1_IN44 input. */
#define IMXRT_XBARA1_IN_ACMP4_OUT                            IMXRT_XBARA1(XBAR_INPUT, 45)     /* ACMP4_OUT output assigned to XBARA1_IN45 input. */
#define IMXRT_XBARA1_IN_GND46                                IMXRT_XBARA1(XBAR_INPUT, 46)     /* GND assigned to XBARA1_IN46 input. */
#define IMXRT_XBARA1_IN_GND47                                IMXRT_XBARA1(XBAR_INPUT, 47)     /* GND assigned to XBARA1_IN47 input. */
#define IMXRT_XBARA1_IN_GND48                                IMXRT_XBARA1(XBAR_INPUT, 48)     /* GND assigned to XBARA1_IN48 input. */
#define IMXRT_XBARA1_IN_GND49                                IMXRT_XBARA1(XBAR_INPUT, 49)     /* GND assigned to XBARA1_IN49 input. */
#define IMXRT_XBARA1_IN_QTIMER1_TMR0_OUT                     IMXRT_XBARA1(XBAR_INPUT, 50)     /* QTIMER1_TMR0_OUTPUT output assigned to XBARA1_IN50 input. */
#define IMXRT_XBARA1_IN_QTIMER1_TMR1_OUT                     IMXRT_XBARA1(XBAR_INPUT, 51)     /* QTIMER1_TMR1_OUTPUT output assigned to XBARA1_IN51 input. */
#define IMXRT_XBARA1_IN_QTIMER1_TMR2_OUT                     IMXRT_XBARA1(XBAR_INPUT, 52)     /* QTIMER1_TMR2_OUTPUT output assigned to XBARA1_IN52 input. */
#define IMXRT_XBARA1_IN_QTIMER1_TMR3_OUT                     IMXRT_XBARA1(XBAR_INPUT, 53)     /* QTIMER1_TMR3_OUTPUT output assigned to XBARA1_IN53 input. */
#define IMXRT_XBARA1_IN_QTIMER2_TMR0_OUT                     IMXRT_XBARA1(XBAR_INPUT, 54)     /* QTIMER2_TMR0_OUTPUT output assigned to XBARA1_IN54 input. */
#define IMXRT_XBARA1_IN_QTIMER2_TMR1_OUT                     IMXRT_XBARA1(XBAR_INPUT, 55)     /* QTIMER2_TMR1_OUTPUT output assigned to XBARA1_IN55 input. */
#define IMXRT_XBARA1_IN_QTIMER2_TMR2_OUT                     IMXRT_XBARA1(XBAR_INPUT, 56)     /* QTIMER2_TMR2_OUTPUT output assigned to XBARA1_IN56 input. */
#define IMXRT_XBARA1_IN_QTIMER2_TMR3_OUT                     IMXRT_XBARA1(XBAR_INPUT, 57)     /* QTIMER2_TMR3_OUTPUT output assigned to XBARA1_IN57 input. */
#define IMXRT_XBARA1_IN_QTIMER3_TMR0_OUT                     IMXRT_XBARA1(XBAR_INPUT, 58)     /* QTIMER3_TMR0_OUTPUT output assigned to XBARA1_IN58 input. */
#define IMXRT_XBARA1_IN_QTIMER3_TMR1_OUT                     IMXRT_XBARA1(XBAR_INPUT, 59)     /* QTIMER3_TMR1_OUTPUT output assigned to XBARA1_IN59 input. */
#define IMXRT_XBARA1_IN_QTIMER3_TMR2_OUT                     IMXRT_XBARA1(XBAR_INPUT, 60)     /* QTIMER3_TMR2_OUTPUT output assigned to XBARA1_IN60 input. */
#define IMXRT_XBARA1_IN_QTIMER3_TMR3_OUT                     IMXRT_XBARA1(XBAR_INPUT, 61)     /* QTIMER3_TMR3_OUTPUT output assigned to XBARA1_IN61 input. */
#define IMXRT_XBARA1_IN_QTIMER4_TMR0_OUT                     IMXRT_XBARA1(XBAR_INPUT, 62)     /* QTIMER4_TMR0_OUTPUT output assigned to XBARA1_IN62 input. */
#define IMXRT_XBARA1_IN_QTIMER4_TMR1_OUT                     IMXRT_XBARA1(XBAR_INPUT, 63)     /* QTIMER4_TMR1_OUTPUT output assigned to XBARA1_IN63 input. */
#define IMXRT_XBARA1_IN_QTIMER4_TMR2_OUT                     IMXRT_XBARA1(XBAR_INPUT, 64)     /* QTIMER4_TMR2_OUTPUT output assigned to XBARA1_IN64 input. */
#define IMXRT_XBARA1_IN_QTIMER4_TMR3_OUT                     IMXRT_XBARA1(XBAR_INPUT, 65)     /* QTIMER4_TMR3_OUTPUT output assigned to XBARA1_IN65 input. */
#define IMXRT_XBARA1_IN_GND66                                IMXRT_XBARA1(XBAR_INPUT, 66)     /* GND assigned to XBARA1_IN66 input. */
#define IMXRT_XBARA1_IN_GND67                                IMXRT_XBARA1(XBAR_INPUT, 67)     /* GND assigned to XBARA1_IN67 input. */
#define IMXRT_XBARA1_IN_GND68                                IMXRT_XBARA1(XBAR_INPUT, 68)     /* GND assigned to XBARA1_IN68 input. */
#define IMXRT_XBARA1_IN_GND69                                IMXRT_XBARA1(XBAR_INPUT, 69)     /* GND assigned to XBARA1_IN69 input. */
#define IMXRT_XBARA1_IN_GND70                                IMXRT_XBARA1(XBAR_INPUT, 70)     /* GND assigned to XBARA1_IN70 input. */
#define IMXRT_XBARA1_IN_GND71                                IMXRT_XBARA1(XBAR_INPUT, 71)     /* GND assigned to XBARA1_IN71 input. */
#define IMXRT_XBARA1_IN_GND72                                IMXRT_XBARA1(XBAR_INPUT, 72)     /* GND assigned to XBARA1_IN72 input. */
#define IMXRT_XBARA1_IN_GND73                                IMXRT_XBARA1(XBAR_INPUT, 73)     /* GND assigned to XBARA1_IN73 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM0_OUT_TRIG0              IMXRT_XBARA1(XBAR_INPUT, 74)     /* FLEXPWM1_PWM0_OUT_TRIG0 output assigned to XBARA1_IN74 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM0_OUT_TRIG1              IMXRT_XBARA1(XBAR_INPUT, 75)     /* FLEXPWM1_PWM0_OUT_TRIG1 output assigned to XBARA1_IN75 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM1_OUT_TRIG0              IMXRT_XBARA1(XBAR_INPUT, 76)     /* FLEXPWM1_PWM1_OUT_TRIG0 output assigned to XBARA1_IN76 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM1_OUT_TRIG1              IMXRT_XBARA1(XBAR_INPUT, 77)     /* FLEXPWM1_PWM1_OUT_TRIG1 output assigned to XBARA1_IN77 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM2_OUT_TRIG0              IMXRT_XBARA1(XBAR_INPUT, 78)     /* FLEXPWM1_PWM2_OUT_TRIG0 output assigned to XBARA1_IN78 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM2_OUT_TRIG1              IMXRT_XBARA1(XBAR_INPUT, 79)     /* FLEXPWM1_PWM2_OUT_TRIG1 output assigned to XBARA1_IN79 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM3_OUT_TRIG0              IMXRT_XBARA1(XBAR_INPUT, 80)     /* FLEXPWM1_PWM3_OUT_TRIG0 output assigned to XBARA1_IN80 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM3_OUT_TRIG1              IMXRT_XBARA1(XBAR_INPUT, 81)     /* FLEXPWM1_PWM3_OUT_TRIG1 output assigned to XBARA1_IN81 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM0_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 82)     /* FLEXPWM2_PWM0_OUT_TRIG0_1 output assigned to XBARA1_IN82 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM1_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 83)     /* FLEXPWM2_PWM1_OUT_TRIG0_1 output assigned to XBARA1_IN83 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM2_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 84)     /* FLEXPWM2_PWM2_OUT_TRIG0_1 output assigned to XBARA1_IN84 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM3_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 85)     /* FLEXPWM2_PWM3_OUT_TRIG0_1 output assigned to XBARA1_IN85 input. */
#define IMXRT_XBARA1_IN_FLEXPWM3_PWM0_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 86)     /* FLEXPWM3_PWM0_OUT_TRIG0_1 output assigned to XBARA1_IN86 input. */
#define IMXRT_XBARA1_IN_FLEXPWM3_PWM1_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 87)     /* FLEXPWM3_PWM1_OUT_TRIG0_1 output assigned to XBARA1_IN87 input. */
#define IMXRT_XBARA1_IN_FLEXPWM3_PWM2_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 88)     /* FLEXPWM3_PWM2_OUT_TRIG0_1 output assigned to XBARA1_IN88 input. */
#define IMXRT_XBARA1_IN_FLEXPWM3_PWM3_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 89)     /* FLEXPWM3_PWM3_OUT_TRIG0_1 output assigned to XBARA1_IN89 input. */
#define IMXRT_XBARA1_IN_FLEXPWM4_PWM0_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 90)     /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBARA1_IN90 input. */
#define IMXRT_XBARA1_IN_FLEXPWM4_PWM1_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 91)     /* FLEXPWM4_PWM1_OUT_TRIG0_1 output assigned to XBARA1_IN91 input. */
#define IMXRT_XBARA1_IN_FLEXPWM4_PWM2_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 92)     /* FLEXPWM4_PWM2_OUT_TRIG0_1 output assigned to XBARA1_IN92 input. */
#define IMXRT_XBARA1_IN_FLEXPWM4_PWM3_OUT_TRIG01             IMXRT_XBARA1(XBAR_INPUT, 93)     /* FLEXPWM4_PWM3_OUT_TRIG0_1 output assigned to XBARA1_IN93 input. */
#define IMXRT_XBARA1_IN_GND94                                IMXRT_XBARA1(XBAR_INPUT, 94)     /* GND assigned to XBARA1_IN94 input. */
#define IMXRT_XBARA1_IN_GND95                                IMXRT_XBARA1(XBAR_INPUT, 95)     /* GND assigned to XBARA1_IN95 input. */
#define IMXRT_XBARA1_IN_GND96                                IMXRT_XBARA1(XBAR_INPUT, 96)     /* GND assigned to XBARA1_IN96 input. */
#define IMXRT_XBARA1_IN_GND97                                IMXRT_XBARA1(XBAR_INPUT, 97)     /* GND assigned to XBARA1_IN97 input. */
#define IMXRT_XBARA1_IN_GND98                                IMXRT_XBARA1(XBAR_INPUT, 98)     /* GND assigned to XBARA1_IN98 input. */
#define IMXRT_XBARA1_IN_GND99                                IMXRT_XBARA1(XBAR_INPUT, 99)     /* GND assigned to XBARA1_IN99 input. */
#define IMXRT_XBARA1_IN_GND100                               IMXRT_XBARA1(XBAR_INPUT, 100)    /* GND assigned to XBARA1_IN100 input. */
#define IMXRT_XBARA1_IN_GND101                               IMXRT_XBARA1(XBAR_INPUT, 101)    /* GND assigned to XBARA1_IN101 input. */
#define IMXRT_XBARA1_IN_PIT1_TRIGGER0                        IMXRT_XBARA1(XBAR_INPUT, 102)    /* PIT1_TRIGGER0 output assigned to XBARA1_IN102 input. */
#define IMXRT_XBARA1_IN_PIT1_TRIGGER1                        IMXRT_XBARA1(XBAR_INPUT, 103)    /* PIT1_TRIGGER1 output assigned to XBARA1_IN103 input. */
#define IMXRT_XBARA1_IN_PIT1_TRIGGER2                        IMXRT_XBARA1(XBAR_INPUT, 104)    /* PIT1_TRIGGER2 output assigned to XBARA1_IN104 input. */
#define IMXRT_XBARA1_IN_PIT1_TRIGGER3                        IMXRT_XBARA1(XBAR_INPUT, 105)    /* PIT1_TRIGGER3 output assigned to XBARA1_IN105 input. */
#define IMXRT_XBARA1_IN_QDC1_POSMATCH                        IMXRT_XBARA1(XBAR_INPUT, 106)    /* QDC1_POSMATCH output assigned to XBARA1_IN106 input. */
#define IMXRT_XBARA1_IN_QDC2_POSMATCH                        IMXRT_XBARA1(XBAR_INPUT, 107)    /* QDC1_POSMATCH output assigned to XBARA1_IN107 input. */
#define IMXRT_XBARA1_IN_QDC3_POSMATCH                        IMXRT_XBARA1(XBAR_INPUT, 108)    /* QDC1_POSMATCH output assigned to XBARA1_IN108 input. */
#define IMXRT_XBARA1_IN_QDC4_POSMATCH                        IMXRT_XBARA1(XBAR_INPUT, 109)    /* QDC1_POSMATCH output assigned to XBARA1_IN109 input. */
#define IMXRT_XBARA1_IN_GND110                               IMXRT_XBARA1(XBAR_INPUT, 110)    /* GND assigned to XBARA1_IN110 input. */
#define IMXRT_XBARA1_IN_GND111                               IMXRT_XBARA1(XBAR_INPUT, 111)    /* GND assigned to XBARA1_IN111 input. */
#define IMXRT_XBARA1_IN_EDMA_DONE0                           IMXRT_XBARA1(XBAR_INPUT, 112)    /* EDMA_DONE0 output assigned to XBARA1_IN112 input. */
#define IMXRT_XBARA1_IN_EDMA_DONE1                           IMXRT_XBARA1(XBAR_INPUT, 113)    /* EDMA_DONE1 output assigned to XBARA1_IN113 input. */
#define IMXRT_XBARA1_IN_EDMA_DONE2                           IMXRT_XBARA1(XBAR_INPUT, 114)    /* EDMA_DONE2 output assigned to XBARA1_IN114 input. */
#define IMXRT_XBARA1_IN_EDMA_DONE3                           IMXRT_XBARA1(XBAR_INPUT, 115)    /* EDMA_DONE3 output assigned to XBARA1_IN115 input. */
#define IMXRT_XBARA1_IN_EDMA_DONE4                           IMXRT_XBARA1(XBAR_INPUT, 116)    /* EDMA_DONE4 output assigned to XBARA1_IN116 input. */
#define IMXRT_XBARA1_IN_EDMA_DONE5                           IMXRT_XBARA1(XBAR_INPUT, 117)    /* EDMA_DONE5 output assigned to XBARA1_IN117 input. */
#define IMXRT_XBARA1_IN_EDMA_DONE6                           IMXRT_XBARA1(XBAR_INPUT, 118)    /* EDMA_DONE6 output assigned to XBARA1_IN118 input. */
#define IMXRT_XBARA1_IN_EDMA_DONE7                           IMXRT_XBARA1(XBAR_INPUT, 119)    /* EDMA_DONE7 output assigned to XBARA1_IN119 input. */
#define IMXRT_XBARA1_IN_EDMA_LPSR_DONE0                      IMXRT_XBARA1(XBAR_INPUT, 120)    /* EDMA_LPSR_DONE0 output assigned to XBARA1_IN120 input. */
#define IMXRT_XBARA1_IN_EDMA_LPSR_DONE1                      IMXRT_XBARA1(XBAR_INPUT, 121)    /* EDMA_LPSR_DONE1 output assigned to XBARA1_IN121 input. */
#define IMXRT_XBARA1_IN_EDMA_LPSR_DONE2                      IMXRT_XBARA1(XBAR_INPUT, 122)    /* EDMA_LPSR_DONE2 output assigned to XBARA1_IN122 input. */
#define IMXRT_XBARA1_IN_EDMA_LPSR_DONE3                      IMXRT_XBARA1(XBAR_INPUT, 123)    /* EDMA_LPSR_DONE3 output assigned to XBARA1_IN123 input. */
#define IMXRT_XBARA1_IN_EDMA_LPSR_DONE4                      IMXRT_XBARA1(XBAR_INPUT, 124)    /* EDMA_LPSR_DONE4 output assigned to XBARA1_IN124 input. */
#define IMXRT_XBARA1_IN_EDMA_LPSR_DONE5                      IMXRT_XBARA1(XBAR_INPUT, 125)    /* EDMA_LPSR_DONE5 output assigned to XBARA1_IN125 input. */
#define IMXRT_XBARA1_IN_EDMA_LPSR_DONE6                      IMXRT_XBARA1(XBAR_INPUT, 126)    /* EDMA_LPSR_DONE6 output assigned to XBARA1_IN126 input. */
#define IMXRT_XBARA1_IN_EDMA_LPSR_DONE7                      IMXRT_XBARA1(XBAR_INPUT, 127)    /* EDMA_LPSR_DONE7 output assigned to XBARA1_IN127 input. */
#define IMXRT_XBARA1_IN_AOI1_OUT0                            IMXRT_XBARA1(XBAR_INPUT, 128)    /* AOI1_OUT0 output assigned to XBARA1_IN128 input. */
#define IMXRT_XBARA1_IN_AOI1_OUT1                            IMXRT_XBARA1(XBAR_INPUT, 129)    /* AOI1_OUT1 output assigned to XBARA1_IN129 input. */
#define IMXRT_XBARA1_IN_AOI1_OUT2                            IMXRT_XBARA1(XBAR_INPUT, 130)    /* AOI1_OUT2 output assigned to XBARA1_IN130 input. */
#define IMXRT_XBARA1_IN_AOI1_OUT3                            IMXRT_XBARA1(XBAR_INPUT, 131)    /* AOI1_OUT3 output assigned to XBARA1_IN131 input. */
#define IMXRT_XBARA1_IN_AOI2_OUT0                            IMXRT_XBARA1(XBAR_INPUT, 132)    /* AOI2_OUT0 output assigned to XBARA1_IN132 input. */
#define IMXRT_XBARA1_IN_AOI2_OUT1                            IMXRT_XBARA1(XBAR_INPUT, 133)    /* AOI2_OUT1 output assigned to XBARA1_IN133 input. */
#define IMXRT_XBARA1_IN_AOI2_OUT2                            IMXRT_XBARA1(XBAR_INPUT, 134)    /* AOI2_OUT2 output assigned to XBARA1_IN134 input. */
#define IMXRT_XBARA1_IN_AOI2_OUT3                            IMXRT_XBARA1(XBAR_INPUT, 135)    /* AOI2_OUT3 output assigned to XBARA1_IN135 input. */
#define IMXRT_XBARA1_IN_ADC_ETC0_COCO0                       IMXRT_XBARA1(XBAR_INPUT, 136)    /* ADC_ETC0_COCO0 output assigned to XBARA1_IN136 input. */
#define IMXRT_XBARA1_IN_ADC_ETC0_COCO1                       IMXRT_XBARA1(XBAR_INPUT, 137)    /* ADC_ETC0_COCO1 output assigned to XBARA1_IN137 input. */
#define IMXRT_XBARA1_IN_ADC_ETC0_COCO2                       IMXRT_XBARA1(XBAR_INPUT, 138)    /* ADC_ETC0_COCO2 output assigned to XBARA1_IN138 input. */
#define IMXRT_XBARA1_IN_ADC_ETC0_COCO3                       IMXRT_XBARA1(XBAR_INPUT, 139)    /* ADC_ETC0_COCO3 output assigned to XBARA1_IN139 input. */
#define IMXRT_XBARA1_IN_ADC_ETC1_COCO0                       IMXRT_XBARA1(XBAR_INPUT, 140)    /* ADC_ETC1_COCO0 output assigned to XBARA1_IN140 input. */
#define IMXRT_XBARA1_IN_ADC_ETC1_COCO1                       IMXRT_XBARA1(XBAR_INPUT, 141)    /* ADC_ETC1_COCO1 output assigned to XBARA1_IN141 input. */
#define IMXRT_XBARA1_IN_ADC_ETC1_COCO2                       IMXRT_XBARA1(XBAR_INPUT, 142)    /* ADC_ETC1_COCO2 output assigned to XBARA1_IN142 input. */
#define IMXRT_XBARA1_IN_ADC_ETC1_COCO3                       IMXRT_XBARA1(XBAR_INPUT, 143)    /* ADC_ETC1_COCO3 output assigned to XBARA1_IN143 input. */
#define IMXRT_XBARA1_IN_GND144                               IMXRT_XBARA1(XBAR_INPUT, 144)    /* GND assigned to XBARA1_IN144 input. */
#define IMXRT_XBARA1_IN_GND145                               IMXRT_XBARA1(XBAR_INPUT, 145)    /* GND assigned to XBARA1_IN145 input. */

