apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_xbar.h
/* XBARA1 Mux Output (M Muxes) **********************************************/

#define IMXRT_XBARA1_OUT_DMA_CH_MUX_REQ81_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 0)     /* XBARA1_OUT0 output assigned to DMA_CH_MUX_REQ81 */
#define IMXRT_XBARA1_OUT_DMA_CH_MUX_REQ82_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 1)     /* XBARA1_OUT1 output assigned to DMA_CH_MUX_REQ82 */
#define IMXRT_XBARA1_OUT_DMA_CH_MUX_REQ83_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 2)     /* XBARA1_OUT2 output assigned to DMA_CH_MUX_REQ83 */
#define IMXRT_XBARA1_OUT_DMA_CH_MUX_REQ84_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 3)     /* XBARA1_OUT3 output assigned to DMA_CH_MUX_REQ84 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO04_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 4)     /* XBARA1_OUT4 output assigned to IOMUX_XBAR_INOUT04 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO05_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 5)     /* XBARA1_OUT5 output assigned to IOMUX_XBAR_INOUT05 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO06_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 6)     /* XBARA1_OUT6 output assigned to IOMUX_XBAR_INOUT06 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO07_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 7)     /* XBARA1_OUT7 output assigned to IOMUX_XBAR_INOUT07 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO08_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 8)     /* XBARA1_OUT8 output assigned to IOMUX_XBAR_INOUT08 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO09_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 9)     /* XBARA1_OUT9 output assigned to IOMUX_XBAR_INOUT09 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO10_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 10)    /* XBARA1_OUT10 output assigned to IOMUX_XBAR_INOUT10 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO11_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 11)    /* XBARA1_OUT11 output assigned to IOMUX_XBAR_INOUT11 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO12_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 12)    /* XBARA1_OUT12 output assigned to IOMUX_XBAR_INOUT12 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO13_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 13)    /* XBARA1_OUT13 output assigned to IOMUX_XBAR_INOUT13 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO14_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 14)    /* XBARA1_OUT14 output assigned to IOMUX_XBAR_INOUT14 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO15_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 15)    /* XBARA1_OUT15 output assigned to IOMUX_XBAR_INOUT15 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO16_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 16)    /* XBARA1_OUT16 output assigned to IOMUX_XBAR_INOUT16 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO17_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 17)    /* XBARA1_OUT17 output assigned to IOMUX_XBAR_INOUT17 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO18_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 18)    /* XBARA1_OUT18 output assigned to IOMUX_XBAR_INOUT18 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO19_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 19)    /* XBARA1_OUT19 output assigned to IOMUX_XBAR_INOUT19 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO20_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 20)    /* XBARA1_OUT20 output assigned to IOMUX_XBAR_INOUT20 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO21_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 21)    /* XBARA1_OUT21 output assigned to IOMUX_XBAR_INOUT21 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO22_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 22)    /* XBARA1_OUT22 output assigned to IOMUX_XBAR_INOUT22 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO23_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 23)    /* XBARA1_OUT23 output assigned to IOMUX_XBAR_INOUT23 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO24_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 24)    /* XBARA1_OUT24 output assigned to IOMUX_XBAR_INOUT24 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO25_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 25)    /* XBARA1_OUT25 output assigned to IOMUX_XBAR_INOUT25 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO26_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 26)    /* XBARA1_OUT26 output assigned to IOMUX_XBAR_INOUT26 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO27_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 27)    /* XBARA1_OUT27 output assigned to IOMUX_XBAR_INOUT27 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO28_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 28)    /* XBARA1_OUT28 output assigned to IOMUX_XBAR_INOUT28 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO29_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 29)    /* XBARA1_OUT29 output assigned to IOMUX_XBAR_INOUT29 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO30_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 30)    /* XBARA1_OUT30 output assigned to IOMUX_XBAR_INOUT30 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO31_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 31)    /* XBARA1_OUT31 output assigned to IOMUX_XBAR_INOUT31 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO32_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 32)    /* XBARA1_OUT32 output assigned to IOMUX_XBAR_INOUT32 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO33_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 33)    /* XBARA1_OUT33 output assigned to IOMUX_XBAR_INOUT33 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO34_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 34)    /* XBARA1_OUT34 output assigned to IOMUX_XBAR_INOUT34 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO35_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 35)    /* XBARA1_OUT35 output assigned to IOMUX_XBAR_INOUT35 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO36_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 36)    /* XBARA1_OUT36 output assigned to IOMUX_XBAR_INOUT36 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO37_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 37)    /* XBARA1_OUT37 output assigned to IOMUX_XBAR_INOUT37 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO38_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 38)    /* XBARA1_OUT38 output assigned to IOMUX_XBAR_INOUT38 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO39_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 39)    /* XBARA1_OUT39 output assigned to IOMUX_XBAR_INOUT39 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO40_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 40)    /* XBARA1_OUT40 output assigned to IOMUX_XBAR_INOUT40 */
#define IMXRT_XBARA1_OUT_ACMP1_SAMPLE_SEL_OFFSET             IMXRT_XBARA1(XBAR_OUTPUT, 41)    /* XBARA1_OUT41 output assigned to ACMP1_SAMPLE */
#define IMXRT_XBARA1_OUT_ACMP2_SAMPLE_SEL_OFFSET             IMXRT_XBARA1(XBAR_OUTPUT, 42)    /* XBARA1_OUT42 output assigned to ACMP2_SAMPLE */
#define IMXRT_XBARA1_OUT_ACMP3_SAMPLE_SEL_OFFSET             IMXRT_XBARA1(XBAR_OUTPUT, 43)    /* XBARA1_OUT43 output assigned to ACMP3_SAMPLE */
#define IMXRT_XBARA1_OUT_ACMP4_SAMPLE_SEL_OFFSET             IMXRT_XBARA1(XBAR_OUTPUT, 44)    /* XBARA1_OUT44 output assigned to ACMP4_SAMPLE */
#define IMXRT_XBARA1_OUT_RESERVED45_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 45)    /* XBARA1_OUT45 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED46_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 46)    /* XBARA1_OUT46 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED47_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 47)    /* XBARA1_OUT47 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED48_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 48)    /* XBARA1_OUT48 output is reserved. */
#define IMXRT_XBARA1_OUT_FLEXPWM1_PWM0_EXTA_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 49)    /* XBARA1_OUT49 output assigned to FLEXPWM1_PWM0_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM1_PWM1_EXTA_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 50)    /* XBARA1_OUT50 output assigned to FLEXPWM1_PWM1_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM1_PWM2_EXTA_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 51)    /* XBARA1_OUT51 output assigned to FLEXPWM1_PWM2_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM1_PWM3_EXTA_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 52)    /* XBARA1_OUT52 output assigned to FLEXPWM1_PWM3_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM1_PWM0_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 53)    /* XBARA1_OUT53 output assigned to FLEXPWM1_PWM0_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM1_PWM1_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 54)    /* XBARA1_OUT54 output assigned to FLEXPWM1_PWM1_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM1_PWM2_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 55)    /* XBARA1_OUT55 output assigned to FLEXPWM1_PWM2_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM1_PWM3_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 56)    /* XBARA1_OUT56 output assigned to FLEXPWM1_PWM3_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXT_CLK_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 57)    /* XBARA1_OUT57 output assigned to FLEXPWM1_EXT_CLK */
#define IMXRT_XBARA1_OUT_FLEXPWM1_FAULT0_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 58)    /* XBARA1_OUT58 output assigned to FLEXPWM1_FAULT0 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_FAULT1_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 59)    /* XBARA1_OUT59 output assigned to FLEXPWM1_FAULT1 */
#define IMXRT_XBARA1_OUT_FLEXPWM1234_FAULT2_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 60)    /* XBARA1_OUT60 output assigned to FLEXPWM1_2_3_4_FAULT2 */
#define IMXRT_XBARA1_OUT_FLEXPWM1234_FAULT3_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 61)    /* XBARA1_OUT61 output assigned to FLEXPWM1_2_3_4_FAULT3 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXT_FORCE_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 62)    /* XBARA1_OUT62 output assigned to FLEXPWM1_EXT_FORCE */
#define IMXRT_XBARA1_OUT_FLEXPWM2_PWM0_EXTA_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 63)    /* XBARA1_OUT63 output assigned to FLEXPWM2_PWM0_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM2_PWM1_EXTA_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 64)    /* XBARA1_OUT64 output assigned to FLEXPWM2_PWM1_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM2_PWM2_EXTA_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 65)    /* XBARA1_OUT65 output assigned to FLEXPWM2_PWM2_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM2_PWM3_EXTA_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 66)    /* XBARA1_OUT66 output assigned to FLEXPWM2_PWM3_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM2_PWM0_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 67)    /* XBARA1_OUT67 output assigned to FLEXPWM2_PWM0_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM2_PWM1_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 68)    /* XBARA1_OUT68 output assigned to FLEXPWM2_PWM1_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM2_PWM2_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 69)    /* XBARA1_OUT69 output assigned to FLEXPWM2_PWM2_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM2_PWM3_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 70)    /* XBARA1_OUT70 output assigned to FLEXPWM2_PWM3_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXT_CLK_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 71)    /* XBARA1_OUT71 output assigned to FLEXPWM2_EXT_CLK */
#define IMXRT_XBARA1_OUT_FLEXPWM2_FAULT0_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 72)    /* XBARA1_OUT72 output assigned to FLEXPWM2_FAULT0 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_FAULT1_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 73)    /* XBARA1_OUT73 output assigned to FLEXPWM2_FAULT1 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXT_FORCE_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 74)    /* XBARA1_OUT74 output assigned to FLEXPWM2_EXT_FORCE */
#define IMXRT_XBARA1_OUT_FLEXPWM34_PWM0_EXTA_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 75)    /* XBARA1_OUT75 output assigned to FLEXPWM3_4_PWM0_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM34_PWM1_EXTA_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 76)    /* XBARA1_OUT76 output assigned to FLEXPWM3_4_PWM1_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM34_PWM2_EXTA_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 77)    /* XBARA1_OUT77 output assigned to FLEXPWM3_4_PWM2_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM34_PWM3_EXTA_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 78)    /* XBARA1_OUT78 output assigned to FLEXPWM3_4_PWM3_EXTA */
#define IMXRT_XBARA1_OUT_FLEXPWM34_EXT_CLK_SEL_OFFSET        IMXRT_XBARA1(XBAR_OUTPUT, 79)    /* XBARA1_OUT79 output assigned to FLEXPWM3_4_EXT_CLK */
#define IMXRT_XBARA1_OUT_FLEXPWM3_PWM0_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 80)    /* XBARA1_OUT80 output assigned to FLEXPWM3_PWM0_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM3_PWM1_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 81)    /* XBARA1_OUT81 output assigned to FLEXPWM3_PWM1_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM3_PWM2_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 82)    /* XBARA1_OUT82 output assigned to FLEXPWM3_PWM2_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM3_PWM3_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 83)    /* XBARA1_OUT83 output assigned to FLEXPWM3_PWM3_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM3_FAULT0_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 84)    /* XBARA1_OUT84 output assigned to FLEXPWM3_FAULT0 */
#define IMXRT_XBARA1_OUT_FLEXPWM3_FAULT1_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 85)    /* XBARA1_OUT85 output assigned to FLEXPWM3_FAULT1 */
#define IMXRT_XBARA1_OUT_FLEXPWM3_EXT_FORCE_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 86)    /* XBARA1_OUT86 output assigned to FLEXPWM3_EXT_FORCE */
#define IMXRT_XBARA1_OUT_FLEXPWM4_PWM0_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 87)    /* XBARA1_OUT87 output assigned to FLEXPWM4_PWM0_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM4_PWM1_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 88)    /* XBARA1_OUT88 output assigned to FLEXPWM4_PWM1_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM4_PWM2_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 89)    /* XBARA1_OUT89 output assigned to FLEXPWM4_PWM2_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM4_PWM3_EXT_SYNC_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 90)    /* XBARA1_OUT90 output assigned to FLEXPWM4_PWM3_EXT_SYNC */
#define IMXRT_XBARA1_OUT_FLEXPWM4_FAULT0_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 91)    /* XBARA1_OUT91 output assigned to FLEXPWM4_FAULT0 */
#define IMXRT_XBARA1_OUT_FLEXPWM4_FAULT1_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 92)    /* XBARA1_OUT92 output assigned to FLEXPWM4_FAULT1 */
#define IMXRT_XBARA1_OUT_FLEXPWM4_EXT_FORCE_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 93)    /* XBARA1_OUT93 output assigned to FLEXPWM4_EXT_FORCE */
#define IMXRT_XBARA1_OUT_RESERVED94_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 94)    /* XBARA1_OUT94 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED95_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 95)    /* XBARA1_OUT95 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED96_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 96)    /* XBARA1_OUT96 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED97_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 97)    /* XBARA1_OUT97 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED98_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 98)    /* XBARA1_OUT98 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED99_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 99)    /* XBARA1_OUT99 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED100_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 100)   /* XBARA1_OUT100 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED101_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 101)   /* XBARA1_OUT101 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED102_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 102)   /* XBARA1_OUT102 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED103_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 103)   /* XBARA1_OUT103 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED104_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 104)   /* XBARA1_OUT104 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED105_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 105)   /* XBARA1_OUT105 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED106_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 106)   /* XBARA1_OUT106 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED107_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 107)   /* XBARA1_OUT107 output is reserved. */
#define IMXRT_XBARA1_OUT_QDC1_PHASEA_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 108)   /* XBARA1_OUT108 output assigned to QDC1_PHASEA */
#define IMXRT_XBARA1_OUT_QDC1_PHASEB_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 109)   /* XBARA1_OUT109 output assigned to QDC1_PHASEB */
#define IMXRT_XBARA1_OUT_QDC1_INDEX_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 110)   /* XBARA1_OUT110 output assigned to QDC1_INDEX */
#define IMXRT_XBARA1_OUT_QDC1_HOME_SEL_OFFSET                IMXRT_XBARA1(XBAR_OUTPUT, 111)   /* XBARA1_OUT111 output assigned to QDC1_HOME */
#define IMXRT_XBARA1_OUT_QDC1_TRIGGER_SEL_OFFSET             IMXRT_XBARA1(XBAR_OUTPUT, 112)   /* XBARA1_OUT112 output assigned to QDC1_TRIGGER */
#define IMXRT_XBARA1_OUT_QDC2_PHASEA_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 113)   /* XBARA1_OUT113 output assigned to QDC2_PHASEA */
#define IMXRT_XBARA1_OUT_QDC2_PHASEB_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 114)   /* XBARA1_OUT114 output assigned to QDC2_PHASEB */
#define IMXRT_XBARA1_OUT_QDC2_INDEX_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 115)   /* XBARA1_OUT115 output assigned to QDC2_INDEX */
#define IMXRT_XBARA1_OUT_QDC2_HOME_SEL_OFFSET                IMXRT_XBARA1(XBAR_OUTPUT, 116)   /* XBARA1_OUT116 output assigned to QDC2_HOME */
#define IMXRT_XBARA1_OUT_QDC2_TRIGGER_SEL_OFFSET             IMXRT_XBARA1(XBAR_OUTPUT, 117)   /* XBARA1_OUT117 output assigned to QDC2_TRIGGER */
#define IMXRT_XBARA1_OUT_QDC3_PHASEA_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 118)   /* XBARA1_OUT118 output assigned to QDC3_PHASEA */
#define IMXRT_XBARA1_OUT_QDC3_PHASEB_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 119)   /* XBARA1_OUT119 output assigned to QDC3_PHASEB */
#define IMXRT_XBARA1_OUT_QDC3_INDEX_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 120)   /* XBARA1_OUT120 output assigned to QDC3_INDEX */
#define IMXRT_XBARA1_OUT_QDC3_HOME_SEL_OFFSET                IMXRT_XBARA1(XBAR_OUTPUT, 121)   /* XBARA1_OUT121 output assigned to QDC3_HOME */
#define IMXRT_XBARA1_OUT_QDC3_TRIGGER_SEL_OFFSET             IMXRT_XBARA1(XBAR_OUTPUT, 122)   /* XBARA1_OUT122 output assigned to QDC3_TRIGGER */
#define IMXRT_XBARA1_OUT_QDC4_PHASEA_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 123)   /* XBARA1_OUT123 output assigned to QDC4_PHASEA */
#define IMXRT_XBARA1_OUT_QDC4_PHASEB_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 124)   /* XBARA1_OUT124 output assigned to QDC4_PHASEB */
#define IMXRT_XBARA1_OUT_QDC4_INDEX_SEL_OFFSET               IMXRT_XBARA1(XBAR_OUTPUT, 125)   /* XBARA1_OUT125 output assigned to QDC4_INDEX */
#define IMXRT_XBARA1_OUT_QDC4_HOME_SEL_OFFSET                IMXRT_XBARA1(XBAR_OUTPUT, 126)   /* XBARA1_OUT126 output assigned to QDC4_HOME */
#define IMXRT_XBARA1_OUT_QDC4_TRIGGER_SEL_OFFSET             IMXRT_XBARA1(XBAR_OUTPUT, 127)   /* XBARA1_OUT127 output assigned to QDC4_TRIGGER */
#define IMXRT_XBARA1_OUT_RESERVED128_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 128)   /* XBARA1_OUT128 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED129_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 129)   /* XBARA1_OUT129 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED130_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 130)   /* XBARA1_OUT130 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED131_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 131)   /* XBARA1_OUT131 output is reserved. */
#define IMXRT_XBARA1_OUT_CAN1_SEL_OFFSET                     IMXRT_XBARA1(XBAR_OUTPUT, 132)   /* XBARA1_OUT132 output assigned to CAN1 */
#define IMXRT_XBARA1_OUT_CAN2_SEL_OFFSET                     IMXRT_XBARA1(XBAR_OUTPUT, 133)   /* XBARA1_OUT133 output assigned to CAN2 */
#define IMXRT_XBARA1_OUT_RESERVED134_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 134)   /* XBARA1_OUT134 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED135_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 135)   /* XBARA1_OUT135 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED136_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 136)   /* XBARA1_OUT136 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED137_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 137)   /* XBARA1_OUT137 output is reserved. */
#define IMXRT_XBARA1_OUT_QTIMER1_TMR0_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 138)   /* XBARA1_OUT138 output assigned to QTIMER1_TMR0_IN */
#define IMXRT_XBARA1_OUT_QTIMER1_TMR1_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 139)   /* XBARA1_OUT139 output assigned to QTIMER1_TMR1_IN */
#define IMXRT_XBARA1_OUT_QTIMER1_TMR2_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 140)   /* XBARA1_OUT140 output assigned to QTIMER1_TMR2_IN */
#define IMXRT_XBARA1_OUT_QTIMER1_TMR3_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 141)   /* XBARA1_OUT141 output assigned to QTIMER1_TMR3_IN */
#define IMXRT_XBARA1_OUT_QTIMER2_TMR0_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 142)   /* XBARA1_OUT142 output assigned to QTIMER2_TMR0_IN */
#define IMXRT_XBARA1_OUT_QTIMER2_TMR1_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 143)   /* XBARA1_OUT143 output assigned to QTIMER2_TMR1_IN */
#define IMXRT_XBARA1_OUT_QTIMER2_TMR2_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 144)   /* XBARA1_OUT144 output assigned to QTIMER2_TMR2_IN */
#define IMXRT_XBARA1_OUT_QTIMER2_TMR3_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 145)   /* XBARA1_OUT145 output assigned to QTIMER2_TMR3_IN */
#define IMXRT_XBARA1_OUT_QTIMER3_TMR0_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 146)   /* XBARA1_OUT146 output assigned to QTIMER3_TMR0_IN */
#define IMXRT_XBARA1_OUT_QTIMER3_TMR1_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 147)   /* XBARA1_OUT147 output assigned to QTIMER3_TMR1_IN */
#define IMXRT_XBARA1_OUT_QTIMER3_TMR2_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 148)   /* XBARA1_OUT148 output assigned to QTIMER3_TMR2_IN */
#define IMXRT_XBARA1_OUT_QTIMER3_TMR3_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 149)   /* XBARA1_OUT149 output assigned to QTIMER3_TMR3_IN */
#define IMXRT_XBARA1_OUT_QTIMER4_TMR0_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 150)   /* XBARA1_OUT150 output assigned to QTIMER4_TMR0_IN */
#define IMXRT_XBARA1_OUT_QTIMER4_TMR1_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 151)   /* XBARA1_OUT151 output assigned to QTIMER4_TMR1_IN */
#define IMXRT_XBARA1_OUT_QTIMER4_TMR2_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 152)   /* XBARA1_OUT152 output assigned to QTIMER4_TMR2_IN */
#define IMXRT_XBARA1_OUT_QTIMER4_TMR3_IN_SEL_OFFSET          IMXRT_XBARA1(XBAR_OUTPUT, 153)   /* XBARA1_OUT153 output assigned to QTIMER4_TMR3_IN */
#define IMXRT_XBARA1_OUT_EWM_IN_SEL_OFFSET                   IMXRT_XBARA1(XBAR_OUTPUT, 154)   /* XBARA1_OUT154 output assigned to EWM_IN */
#define IMXRT_XBARA1_OUT_ADC_ETC0_TRIG0_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 155)   /* XBARA1_OUT155 output assigned to ADC_ETC0_TRIG0 */
#define IMXRT_XBARA1_OUT_ADC_ETC0_TRIG1_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 156)   /* XBARA1_OUT156 output assigned to ADC_ETC0_TRIG1 */
#define IMXRT_XBARA1_OUT_ADC_ETC0_TRIG2_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 157)   /* XBARA1_OUT157 output assigned to ADC_ETC0_TRIG2 */
#define IMXRT_XBARA1_OUT_ADC_ETC0_TRIG3_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 158)   /* XBARA1_OUT158 output assigned to ADC_ETC0_TRIG3 */
#define IMXRT_XBARA1_OUT_ADC_ETC1_TRIG0_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 159)   /* XBARA1_OUT159 output assigned to ADC_ETC1_TRIG0 */
#define IMXRT_XBARA1_OUT_ADC_ETC1_TRIG1_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 160)   /* XBARA1_OUT160 output assigned to ADC_ETC1_TRIG1 */
#define IMXRT_XBARA1_OUT_ADC_ETC1_TRIG2_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 161)   /* XBARA1_OUT161 output assigned to ADC_ETC1_TRIG2 */
