apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_xbar.h
#define IMXRT_XBARA1_OUT_ADC_ETC1_TRIG3_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 162)   /* XBARA1_OUT162 output assigned to ADC_ETC1_TRIG3 */
#define IMXRT_XBARA1_OUT_RESERVED163_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 163)   /* XBARA1_OUT163 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED164_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 164)   /* XBARA1_OUT164 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED165_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 165)   /* XBARA1_OUT165 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED166_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 166)   /* XBARA1_OUT166 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED167_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 167)   /* XBARA1_OUT167 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED168_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 168)   /* XBARA1_OUT168 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED169_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 169)   /* XBARA1_OUT169 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED170_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 170)   /* XBARA1_OUT170 output is reserved. */
#define IMXRT_XBARA1_OUT_FLEXIO1_TRIGGER_IN0_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 171)   /* XBARA1_OUT171 output assigned to FLEXIO1_TRIGGER_IN0 */
#define IMXRT_XBARA1_OUT_FLEXIO1_TRIGGER_IN1_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 172)   /* XBARA1_OUT172 output assigned to FLEXIO1_TRIGGER_IN1 */
#define IMXRT_XBARA1_OUT_FLEXIO2_TRIGGER_IN0_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 173)   /* XBARA1_OUT173 output assigned to FLEXIO2_TRIGGER_IN0 */
#define IMXRT_XBARA1_OUT_FLEXIO2_TRIGGER_IN1_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 174)   /* XBARA1_OUT174 output assigned to FLEXIO2_TRIGGER_IN1 */
#define IMXRT_XBARA1_OUT_RESERVED175_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 175)   /* XBARA1_OUT175 output is reserved. */
#define IMXRT_XBARA1_OUT_RESERVED176_SEL_OFFSET              IMXRT_XBARA1(XBAR_OUTPUT, 176)   /* XBARA1_OUT176 output is reserved. */

/* XBARB2 Mux Inputs (I Values) *********************************************/

#define IMXRT_XBARB2_IN_LOGIC_LOW                            IMXRT_XBARB2(XBAR_INPUT, 0)     /* LOGIC_LOW output assigned to XBARB2_IN0 input. */
#define IMXRT_XBARB2_IN_LOGIC_HIGH                           IMXRT_XBARB2(XBAR_INPUT, 1)     /* LOGIC_HIGH output assigned to XBARB2_IN1 input. */
#define IMXRT_XBARB2_IN_ACMP1_OUT                            IMXRT_XBARB2(XBAR_INPUT, 2)     /* ACMP1_OUT output assigned to XBARB2_IN2 input. */
#define IMXRT_XBARB2_IN_ACMP2_OUT                            IMXRT_XBARB2(XBAR_INPUT, 3)     /* ACMP2_OUT output assigned to XBARB2_IN3 input. */
#define IMXRT_XBARB2_IN_ACMP3_OUT                            IMXRT_XBARB2(XBAR_INPUT, 4)     /* ACMP3_OUT output assigned to XBARB2_IN4 input. */
#define IMXRT_XBARB2_IN_ACMP4_OUT                            IMXRT_XBARB2(XBAR_INPUT, 5)     /* ACMP4_OUT output assigned to XBARB2_IN5 input. */
#define IMXRT_XBARB2_IN_GND6                                 IMXRT_XBARB2(XBAR_INPUT, 6)     /* GND assigned to XBARB2_IN6 input. */
#define IMXRT_XBARB2_IN_GND7                                 IMXRT_XBARB2(XBAR_INPUT, 7)     /* GND assigned to XBARB2_IN7 input. */
#define IMXRT_XBARB2_IN_GND8                                 IMXRT_XBARB2(XBAR_INPUT, 8)     /* GND assigned to XBARB2_IN8 input. */
#define IMXRT_XBARB2_IN_GND9                                 IMXRT_XBARB2(XBAR_INPUT, 9)     /* GND assigned to XBARB2_IN9 input. */
#define IMXRT_XBARB2_IN_QTIMER1_TMR0_OUT                     IMXRT_XBARB2(XBAR_INPUT, 10)    /* QTIMER1_TMR0_OUTPUT output assigned to XBARB2_IN10 input. */
#define IMXRT_XBARB2_IN_QTIMER1_TMR1_OUT                     IMXRT_XBARB2(XBAR_INPUT, 11)    /* QTIMER1_TMR1_OUTPUT output assigned to XBARB2_IN11 input. */
#define IMXRT_XBARB2_IN_QTIMER1_TMR2_OUT                     IMXRT_XBARB2(XBAR_INPUT, 12)    /* QTIMER1_TMR2_OUTPUT output assigned to XBARB2_IN12 input. */
#define IMXRT_XBARB2_IN_QTIMER1_TMR3_OUT                     IMXRT_XBARB2(XBAR_INPUT, 13)    /* QTIMER1_TMR3_OUTPUT output assigned to XBARB2_IN13 input. */
#define IMXRT_XBARB2_IN_QTIMER2_TMR0_OUT                     IMXRT_XBARB2(XBAR_INPUT, 14)    /* QTIMER2_TMR0_OUTPUT output assigned to XBARB2_IN14 input. */
#define IMXRT_XBARB2_IN_QTIMER2_TMR1_OUT                     IMXRT_XBARB2(XBAR_INPUT, 15)    /* QTIMER2_TMR1_OUTPUT output assigned to XBARB2_IN15 input. */
#define IMXRT_XBARB2_IN_QTIMER2_TMR2_OUT                     IMXRT_XBARB2(XBAR_INPUT, 16)    /* QTIMER2_TMR2_OUTPUT output assigned to XBARB2_IN16 input. */
#define IMXRT_XBARB2_IN_QTIMER2_TMR3_OUT                     IMXRT_XBARB2(XBAR_INPUT, 17)    /* QTIMER2_TMR3_OUTPUT output assigned to XBARB2_IN17 input. */
#define IMXRT_XBARB2_IN_QTIMER3_TMR0_OUT                     IMXRT_XBARB2(XBAR_INPUT, 18)    /* QTIMER3_TMR0_OUTPUT output assigned to XBARB2_IN18 input. */
#define IMXRT_XBARB2_IN_QTIMER3_TMR1_OUT                     IMXRT_XBARB2(XBAR_INPUT, 19)    /* QTIMER3_TMR1_OUTPUT output assigned to XBARB2_IN19 input. */
#define IMXRT_XBARB2_IN_QTIMER3_TMR2_OUT                     IMXRT_XBARB2(XBAR_INPUT, 20)    /* QTIMER3_TMR2_OUTPUT output assigned to XBARB2_IN20 input. */
#define IMXRT_XBARB2_IN_QTIMER3_TMR3_OUT                     IMXRT_XBARB2(XBAR_INPUT, 21)    /* QTIMER3_TMR3_OUTPUT output assigned to XBARB2_IN21 input. */
#define IMXRT_XBARB2_IN_QTIMER4_TMR0_OUT                     IMXRT_XBARB2(XBAR_INPUT, 22)    /* QTIMER4_TMR0_OUTPUT output assigned to XBARB2_IN22 input. */
#define IMXRT_XBARB2_IN_QTIMER4_TMR1_OUT                     IMXRT_XBARB2(XBAR_INPUT, 23)    /* QTIMER4_TMR1_OUTPUT output assigned to XBARB2_IN23 input. */
#define IMXRT_XBARB2_IN_QTIMER4_TMR2_OUT                     IMXRT_XBARB2(XBAR_INPUT, 24)    /* QTIMER4_TMR2_OUTPUT output assigned to XBARB2_IN24 input. */
#define IMXRT_XBARB2_IN_QTIMER4_TMR3_OUT                     IMXRT_XBARB2(XBAR_INPUT, 25)    /* QTIMER4_TMR3_OUTPUT output assigned to XBARB2_IN25 input. */
#define IMXRT_XBARB2_IN_GND26                                IMXRT_XBARB2(XBAR_INPUT, 26)    /* GND assigned to XBARB2_IN26 input. */
#define IMXRT_XBARB2_IN_GND27                                IMXRT_XBARB2(XBAR_INPUT, 27)    /* GND assigned to XBARB2_IN27 input. */
#define IMXRT_XBARB2_IN_GND28                                IMXRT_XBARB2(XBAR_INPUT, 28)    /* GND assigned to XBARB2_IN28 input. */
#define IMXRT_XBARB2_IN_GND29                                IMXRT_XBARB2(XBAR_INPUT, 29)    /* GND assigned to XBARB2_IN29 input. */
#define IMXRT_XBARB2_IN_GND30                                IMXRT_XBARB2(XBAR_INPUT, 30)    /* GND assigned to XBARB2_IN30 input. */
#define IMXRT_XBARB2_IN_GND31                                IMXRT_XBARB2(XBAR_INPUT, 31)    /* GND assigned to XBARB2_IN31 input. */
#define IMXRT_XBARB2_IN_GND32                                IMXRT_XBARB2(XBAR_INPUT, 32)    /* GND assigned to XBARB2_IN32 input. */
#define IMXRT_XBARB2_IN_GND33                                IMXRT_XBARB2(XBAR_INPUT, 33)    /* GND assigned to XBARB2_IN33 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM0_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 34)    /* FLEXPWM1_PWM0_OUT_TRIG0_1 output assigned to XBARB2_IN34 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM1_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 35)    /* FLEXPWM1_PWM1_OUT_TRIG0_1 output assigned to XBARB2_IN35 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM2_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 36)    /* FLEXPWM1_PWM2_OUT_TRIG0_1 output assigned to XBARB2_IN36 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM3_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 37)    /* FLEXPWM1_PWM3_OUT_TRIG0_1 output assigned to XBARB2_IN37 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM0_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 38)    /* FLEXPWM2_PWM0_OUT_TRIG0_1 output assigned to XBARB2_IN38 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM1_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 39)    /* FLEXPWM2_PWM1_OUT_TRIG0_1 output assigned to XBARB2_IN39 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM2_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 40)    /* FLEXPWM2_PWM2_OUT_TRIG0_1 output assigned to XBARB2_IN40 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM3_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 41)    /* FLEXPWM2_PWM3_OUT_TRIG0_1 output assigned to XBARB2_IN41 input. */
#define IMXRT_XBARB2_IN_FLEXPWM3_PWM0_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 42)    /* FLEXPWM3_PWM0_OUT_TRIG0_1 output assigned to XBARB2_IN42 input. */
#define IMXRT_XBARB2_IN_FLEXPWM3_PWM1_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 43)    /* FLEXPWM3_PWM1_OUT_TRIG0_1 output assigned to XBARB2_IN43 input. */
#define IMXRT_XBARB2_IN_FLEXPWM3_PWM2_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 44)    /* FLEXPWM3_PWM2_OUT_TRIG0_1 output assigned to XBARB2_IN44 input. */
#define IMXRT_XBARB2_IN_FLEXPWM3_PWM3_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 45)    /* FLEXPWM3_PWM3_OUT_TRIG0_1 output assigned to XBARB2_IN45 input. */
#define IMXRT_XBARB2_IN_FLEXPWM4_PWM0_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 46)    /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBARB2_IN46 input. */
#define IMXRT_XBARB2_IN_FLEXPWM4_PWM1_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 47)    /* FLEXPWM4_PWM1_OUT_TRIG0_1 output assigned to XBARB2_IN47 input. */
#define IMXRT_XBARB2_IN_FLEXPWM4_PWM2_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 48)    /* FLEXPWM4_PWM2_OUT_TRIG0_1 output assigned to XBARB2_IN48 input. */
#define IMXRT_XBARB2_IN_FLEXPWM4_PWM3_OUT_TRIG01             IMXRT_XBARB2(XBAR_INPUT, 49)    /* FLEXPWM4_PWM3_OUT_TRIG0_1 output assigned to XBARB2_IN49 input. */
#define IMXRT_XBARB2_IN_GND50                                IMXRT_XBARB2(XBAR_INPUT, 50)    /* GND assigned to XBARB2_IN50 input. */
#define IMXRT_XBARB2_IN_GND51                                IMXRT_XBARB2(XBAR_INPUT, 51)    /* GND assigned to XBARB2_IN51 input. */
#define IMXRT_XBARB2_IN_GND52                                IMXRT_XBARB2(XBAR_INPUT, 52)    /* GND assigned to XBARB2_IN52 input. */
#define IMXRT_XBARB2_IN_GND53                                IMXRT_XBARB2(XBAR_INPUT, 53)    /* GND assigned to XBARB2_IN53 input. */
#define IMXRT_XBARB2_IN_GND54                                IMXRT_XBARB2(XBAR_INPUT, 54)    /* GND assigned to XBARB2_IN54 input. */
#define IMXRT_XBARB2_IN_GND55                                IMXRT_XBARB2(XBAR_INPUT, 55)    /* GND assigned to XBARB2_IN55 input. */
#define IMXRT_XBARB2_IN_GND56                                IMXRT_XBARB2(XBAR_INPUT, 56)    /* GND assigned to XBARB2_IN56 input. */
#define IMXRT_XBARB2_IN_GND57                                IMXRT_XBARB2(XBAR_INPUT, 57)    /* GND assigned to XBARB2_IN57 input. */
#define IMXRT_XBARB2_IN_PIT1_TRIGGER0                        IMXRT_XBARB2(XBAR_INPUT, 58)    /* PIT1_TRIGGER0 output assigned to XBARB2_IN58 input. */
#define IMXRT_XBARB2_IN_PIT1_TRIGGER1                        IMXRT_XBARB2(XBAR_INPUT, 59)    /* PIT1_TRIGGER1 output assigned to XBARB2_IN59 input. */
#define IMXRT_XBARB2_IN_ADC_ETC0_COCO0                       IMXRT_XBARB2(XBAR_INPUT, 60)    /* ADC_ETC0_COCO0 output assigned to XBARB2_IN60 input. */
#define IMXRT_XBARB2_IN_ADC_ETC0_COCO1                       IMXRT_XBARB2(XBAR_INPUT, 61)    /* ADC_ETC0_COCO1 output assigned to XBARB2_IN61 input. */
#define IMXRT_XBARB2_IN_ADC_ETC0_COCO2                       IMXRT_XBARB2(XBAR_INPUT, 62)    /* ADC_ETC0_COCO2 output assigned to XBARB2_IN62 input. */
#define IMXRT_XBARB2_IN_ADC_ETC0_COCO3                       IMXRT_XBARB2(XBAR_INPUT, 63)    /* ADC_ETC0_COCO3 output assigned to XBARB2_IN63 input. */
#define IMXRT_XBARB2_IN_ADC_ETC1_COCO0                       IMXRT_XBARB2(XBAR_INPUT, 64)    /* ADC_ETC1_COCO0 output assigned to XBARB2_IN64 input. */
#define IMXRT_XBARB2_IN_ADC_ETC1_COCO1                       IMXRT_XBARB2(XBAR_INPUT, 65)    /* ADC_ETC1_COCO1 output assigned to XBARB2_IN65 input. */
#define IMXRT_XBARB2_IN_ADC_ETC1_COCO2                       IMXRT_XBARB2(XBAR_INPUT, 66)    /* ADC_ETC1_COCO2 output assigned to XBARB2_IN66 input. */
#define IMXRT_XBARB2_IN_ADC_ETC1_COCO3                       IMXRT_XBARB2(XBAR_INPUT, 67)    /* ADC_ETC1_COCO3 output assigned to XBARB2_IN67 input. */
#define IMXRT_XBARB2_IN_GND68                                IMXRT_XBARB2(XBAR_INPUT, 68)    /* GND assigned to XBARB2_IN68 input. */
#define IMXRT_XBARB2_IN_GND69                                IMXRT_XBARB2(XBAR_INPUT, 69)    /* GND assigned to XBARB2_IN69 input. */
#define IMXRT_XBARB2_IN_GND70                                IMXRT_XBARB2(XBAR_INPUT, 70)    /* GND assigned to XBARB2_IN70 input. */
#define IMXRT_XBARB2_IN_GND71                                IMXRT_XBARB2(XBAR_INPUT, 71)    /* GND assigned to XBARB2_IN71 input. */
#define IMXRT_XBARB2_IN_GND72                                IMXRT_XBARB2(XBAR_INPUT, 72)    /* GND assigned to XBARB2_IN72 input. */
#define IMXRT_XBARB2_IN_GND73                                IMXRT_XBARB2(XBAR_INPUT, 73)    /* GND assigned to XBARB2_IN73 input. */
#define IMXRT_XBARB2_IN_GND74                                IMXRT_XBARB2(XBAR_INPUT, 74)    /* GND assigned to XBARB2_IN74 input. */
#define IMXRT_XBARB2_IN_GND75                                IMXRT_XBARB2(XBAR_INPUT, 75)    /* GND assigned to XBARB2_IN75 input. */
#define IMXRT_XBARB2_IN_QDC1_POSMATCH                        IMXRT_XBARB2(XBAR_INPUT, 76)    /* QDC1_POSMATCH output assigned to XBARB2_IN76 input. */
#define IMXRT_XBARB2_IN_QDC2_POSMATCH                        IMXRT_XBARB2(XBAR_INPUT, 77)    /* QDC2_POSMATCH output assigned to XBARB2_IN77 input. */
#define IMXRT_XBARB2_IN_QDC3_POSMATCH                        IMXRT_XBARB2(XBAR_INPUT, 78)    /* QDC3_POSMATCH output assigned to XBARB2_IN78 input. */
#define IMXRT_XBARB2_IN_QDC4_POSMATCH                        IMXRT_XBARB2(XBAR_INPUT, 79)    /* QDC4_POSMATCH output assigned to XBARB2_IN79 input. */
#define IMXRT_XBARB2_IN_GND80                                IMXRT_XBARB2(XBAR_INPUT, 80)    /* GND assigned to XBARB2_IN80 input. */
#define IMXRT_XBARB2_IN_GND81                                IMXRT_XBARB2(XBAR_INPUT, 81)    /* GND assigned to XBARB2_IN81 input. */
#define IMXRT_XBARB2_IN_EDMA_DONE0                           IMXRT_XBARB2(XBAR_INPUT, 82)    /* EDMA_DONE0 output assigned to XBARB2_IN82 input. */
#define IMXRT_XBARB2_IN_EDMA_DONE1                           IMXRT_XBARB2(XBAR_INPUT, 83)    /* EDMA_DONE1 output assigned to XBARB2_IN83 input. */
#define IMXRT_XBARB2_IN_EDMA_DONE2                           IMXRT_XBARB2(XBAR_INPUT, 84)    /* EDMA_DONE2 output assigned to XBARB2_IN84 input. */
#define IMXRT_XBARB2_IN_EDMA_DONE3                           IMXRT_XBARB2(XBAR_INPUT, 85)    /* EDMA_DONE3 output assigned to XBARB2_IN85 input. */
#define IMXRT_XBARB2_IN_EDMA_DONE4                           IMXRT_XBARB2(XBAR_INPUT, 86)    /* EDMA_DONE4 output assigned to XBARB2_IN86 input. */
#define IMXRT_XBARB2_IN_EDMA_DONE5                           IMXRT_XBARB2(XBAR_INPUT, 87)    /* EDMA_DONE5 output assigned to XBARB2_IN87 input. */
#define IMXRT_XBARB2_IN_EDMA_DONE6                           IMXRT_XBARB2(XBAR_INPUT, 88)    /* EDMA_DONE6 output assigned to XBARB2_IN88 input. */
#define IMXRT_XBARB2_IN_EDMA_DONE7                           IMXRT_XBARB2(XBAR_INPUT, 89)    /* EDMA_DONE7 output assigned to XBARB2_IN89 input. */
#define IMXRT_XBARB2_IN_EDMA_LPSR_DONE0                      IMXRT_XBARB2(XBAR_INPUT, 90)    /* EDMA_LPSR_DONE0 output assigned to XBARB2_IN90 input. */
#define IMXRT_XBARB2_IN_EDMA_LPSR_DONE1                      IMXRT_XBARB2(XBAR_INPUT, 91)    /* EDMA_LPSR_DONE1 output assigned to XBARB2_IN91 input. */
#define IMXRT_XBARB2_IN_EDMA_LPSR_DONE2                      IMXRT_XBARB2(XBAR_INPUT, 92)    /* EDMA_LPSR_DONE2 output assigned to XBARB2_IN92 input. */
#define IMXRT_XBARB2_IN_EDMA_LPSR_DONE3                      IMXRT_XBARB2(XBAR_INPUT, 93)    /* EDMA_LPSR_DONE3 output assigned to XBARB2_IN93 input. */
#define IMXRT_XBARB2_IN_EDMA_LPSR_DONE4                      IMXRT_XBARB2(XBAR_INPUT, 94)    /* EDMA_LPSR_DONE4 output assigned to XBARB2_IN94 input. */
#define IMXRT_XBARB2_IN_EDMA_LPSR_DONE5                      IMXRT_XBARB2(XBAR_INPUT, 95)    /* EDMA_LPSR_DONE5 output assigned to XBARB2_IN95 input. */
#define IMXRT_XBARB2_IN_EDMA_LPSR_DONE6                      IMXRT_XBARB2(XBAR_INPUT, 96)    /* EDMA_LPSR_DONE6 output assigned to XBARB2_IN96 input. */
#define IMXRT_XBARB2_IN_EDMA_LPSR_DONE7                      IMXRT_XBARB2(XBAR_INPUT, 97)    /* EDMA_LPSR_DONE7 output assigned to XBARB2_IN97 input. */
#define IMXRT_XBARB2_IN_GND98                                IMXRT_XBARB2(XBAR_INPUT, 98)    /* GND assigned to XBARB2_IN98 input. */
#define IMXRT_XBARB2_IN_GND99                                IMXRT_XBARB2(XBAR_INPUT, 99)    /* GND assigned to XBARB2_IN99 input. */

