apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_xbar.h
/* XBARB2 Mux Output (M Muxes) **********************************************/

#define IMXRT_XBARB2_OUT_AOI1_IN00_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 0)    /* XBARB2_OUT0 output assigned to AOI1_IN00 */
#define IMXRT_XBARB2_OUT_AOI1_IN01_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 1)    /* XBARB2_OUT1 output assigned to AOI1_IN01 */
#define IMXRT_XBARB2_OUT_AOI1_IN02_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 2)    /* XBARB2_OUT2 output assigned to AOI1_IN02 */
#define IMXRT_XBARB2_OUT_AOI1_IN03_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 3)    /* XBARB2_OUT3 output assigned to AOI1_IN03 */
#define IMXRT_XBARB2_OUT_AOI1_IN04_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 4)    /* XBARB2_OUT4 output assigned to AOI1_IN04 */
#define IMXRT_XBARB2_OUT_AOI1_IN05_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 5)    /* XBARB2_OUT5 output assigned to AOI1_IN05 */
#define IMXRT_XBARB2_OUT_AOI1_IN06_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 6)    /* XBARB2_OUT6 output assigned to AOI1_IN06 */
#define IMXRT_XBARB2_OUT_AOI1_IN07_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 7)    /* XBARB2_OUT7 output assigned to AOI1_IN07 */
#define IMXRT_XBARB2_OUT_AOI1_IN08_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 8)    /* XBARB2_OUT8 output assigned to AOI1_IN08 */
#define IMXRT_XBARB2_OUT_AOI1_IN09_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 9)    /* XBARB2_OUT9 output assigned to AOI1_IN09 */
#define IMXRT_XBARB2_OUT_AOI1_IN10_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 10)   /* XBARB2_OUT10 output assigned to AOI1_IN10 */
#define IMXRT_XBARB2_OUT_AOI1_IN11_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 11)   /* XBARB2_OUT11 output assigned to AOI1_IN11 */
#define IMXRT_XBARB2_OUT_AOI1_IN12_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 12)   /* XBARB2_OUT12 output assigned to AOI1_IN12 */
#define IMXRT_XBARB2_OUT_AOI1_IN13_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 13)   /* XBARB2_OUT13 output assigned to AOI1_IN13 */
#define IMXRT_XBARB2_OUT_AOI1_IN14_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 14)   /* XBARB2_OUT14 output assigned to AOI1_IN14 */
#define IMXRT_XBARB2_OUT_AOI1_IN15_SEL_OFFSET                IMXRT_XBARB2(XBAR_OUTPUT, 15)   /* XBARB2_OUT15 output assigned to AOI1_IN15 */

/* XBARB3 Mux Inputs (I Values) *********************************************/

#define IMXRT_XBARB3_IN_LOGIC_LOW                            IMXRT_XBARB3(XBAR_INPUT, 0)     /* LOGIC_LOW output assigned to XBARB3_IN0 input. */
#define IMXRT_XBARB3_IN_LOGIC_HIGH                           IMXRT_XBARB3(XBAR_INPUT, 1)     /* LOGIC_HIGH output assigned to XBARB3_IN1 input. */
#define IMXRT_XBARB3_IN_ACMP1_OUT                            IMXRT_XBARB3(XBAR_INPUT, 2)     /* ACMP1_OUT output assigned to XBARB3_IN2 input. */
#define IMXRT_XBARB3_IN_ACMP2_OUT                            IMXRT_XBARB3(XBAR_INPUT, 3)     /* ACMP2_OUT output assigned to XBARB3_IN3 input. */
#define IMXRT_XBARB3_IN_ACMP3_OUT                            IMXRT_XBARB3(XBAR_INPUT, 4)     /* ACMP3_OUT output assigned to XBARB3_IN4 input. */
#define IMXRT_XBARB3_IN_ACMP4_OUT                            IMXRT_XBARB3(XBAR_INPUT, 5)     /* ACMP4_OUT output assigned to XBARB3_IN5 input. */
#define IMXRT_XBARB3_IN_GND6                                 IMXRT_XBARB3(XBAR_INPUT, 6)     /* GND assigned to XBARB3_IN6 input. */
#define IMXRT_XBARB3_IN_GND7                                 IMXRT_XBARB3(XBAR_INPUT, 7)     /* GND assigned to XBARB3_IN7 input. */
#define IMXRT_XBARB3_IN_GND8                                 IMXRT_XBARB3(XBAR_INPUT, 8)     /* GND assigned to XBARB3_IN8 input. */
#define IMXRT_XBARB3_IN_GND9                                 IMXRT_XBARB3(XBAR_INPUT, 9)     /* GND assigned to XBARB3_IN9 input. */
#define IMXRT_XBARB3_IN_QTIMER1_TMR0_OUT                     IMXRT_XBARB3(XBAR_INPUT, 10)    /* QTIMER1_TMR0_OUTPUT output assigned to XBARB3_IN10 input. */
#define IMXRT_XBARB3_IN_QTIMER1_TMR1_OUT                     IMXRT_XBARB3(XBAR_INPUT, 11)    /* QTIMER1_TMR1_OUTPUT output assigned to XBARB3_IN11 input. */
#define IMXRT_XBARB3_IN_QTIMER1_TMR2_OUT                     IMXRT_XBARB3(XBAR_INPUT, 12)    /* QTIMER1_TMR2_OUTPUT output assigned to XBARB3_IN12 input. */
#define IMXRT_XBARB3_IN_QTIMER1_TMR3_OUT                     IMXRT_XBARB3(XBAR_INPUT, 13)    /* QTIMER1_TMR3_OUTPUT output assigned to XBARB3_IN13 input. */
#define IMXRT_XBARB3_IN_QTIMER2_TMR0_OUT                     IMXRT_XBARB3(XBAR_INPUT, 14)    /* QTIMER2_TMR0_OUTPUT output assigned to XBARB3_IN14 input. */
#define IMXRT_XBARB3_IN_QTIMER2_TMR1_OUT                     IMXRT_XBARB3(XBAR_INPUT, 15)    /* QTIMER2_TMR1_OUTPUT output assigned to XBARB3_IN15 input. */
#define IMXRT_XBARB3_IN_QTIMER2_TMR2_OUT                     IMXRT_XBARB3(XBAR_INPUT, 16)    /* QTIMER2_TMR2_OUTPUT output assigned to XBARB3_IN16 input. */
#define IMXRT_XBARB3_IN_QTIMER2_TMR3_OUT                     IMXRT_XBARB3(XBAR_INPUT, 17)    /* QTIMER2_TMR3_OUTPUT output assigned to XBARB3_IN17 input. */
#define IMXRT_XBARB3_IN_QTIMER3_TMR0_OUT                     IMXRT_XBARB3(XBAR_INPUT, 18)    /* QTIMER3_TMR0_OUTPUT output assigned to XBARB3_IN18 input. */
#define IMXRT_XBARB3_IN_QTIMER3_TMR1_OUT                     IMXRT_XBARB3(XBAR_INPUT, 19)    /* QTIMER3_TMR1_OUTPUT output assigned to XBARB3_IN19 input. */
#define IMXRT_XBARB3_IN_QTIMER3_TMR2_OUT                     IMXRT_XBARB3(XBAR_INPUT, 20)    /* QTIMER3_TMR2_OUTPUT output assigned to XBARB3_IN20 input. */
#define IMXRT_XBARB3_IN_QTIMER3_TMR3_OUT                     IMXRT_XBARB3(XBAR_INPUT, 21)    /* QTIMER3_TMR3_OUTPUT output assigned to XBARB3_IN21 input. */
#define IMXRT_XBARB3_IN_QTIMER4_TMR0_OUT                     IMXRT_XBARB3(XBAR_INPUT, 22)    /* QTIMER4_TMR0_OUTPUT output assigned to XBARB3_IN22 input. */
#define IMXRT_XBARB3_IN_QTIMER4_TMR1_OUT                     IMXRT_XBARB3(XBAR_INPUT, 23)    /* QTIMER4_TMR1_OUTPUT output assigned to XBARB3_IN23 input. */
#define IMXRT_XBARB3_IN_QTIMER4_TMR2_OUT                     IMXRT_XBARB3(XBAR_INPUT, 24)    /* QTIMER4_TMR2_OUTPUT output assigned to XBARB3_IN24 input. */
#define IMXRT_XBARB3_IN_QTIMER4_TMR3_OUT                     IMXRT_XBARB3(XBAR_INPUT, 25)    /* QTIMER4_TMR3_OUTPUT output assigned to XBARB3_IN25 input. */
#define IMXRT_XBARB3_IN_GND26                                IMXRT_XBARB3(XBAR_INPUT, 26)    /* GND assigned to XBARB3_IN26 input. */
#define IMXRT_XBARB3_IN_GND27                                IMXRT_XBARB3(XBAR_INPUT, 27)    /* GND assigned to XBARB3_IN27 input. */
#define IMXRT_XBARB3_IN_GND28                                IMXRT_XBARB3(XBAR_INPUT, 28)    /* GND assigned to XBARB3_IN28 input. */
#define IMXRT_XBARB3_IN_GND29                                IMXRT_XBARB3(XBAR_INPUT, 29)    /* GND assigned to XBARB3_IN29 input. */
#define IMXRT_XBARB3_IN_GND30                                IMXRT_XBARB3(XBAR_INPUT, 30)    /* GND assigned to XBARB3_IN30 input. */
#define IMXRT_XBARB3_IN_GND31                                IMXRT_XBARB3(XBAR_INPUT, 31)    /* GND assigned to XBARB3_IN31 input. */
#define IMXRT_XBARB3_IN_GND32                                IMXRT_XBARB3(XBAR_INPUT, 32)    /* GND assigned to XBARB3_IN32 input. */
#define IMXRT_XBARB3_IN_GND33                                IMXRT_XBARB3(XBAR_INPUT, 33)    /* GND assigned to XBARB3_IN33 input. */
#define IMXRT_XBARB3_IN_FLEXPWM1_PWM0_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 34)    /* FLEXPWM1_PWM0_OUT_TRIG0_1 output assigned to XBARB3_IN34 input. */
#define IMXRT_XBARB3_IN_FLEXPWM1_PWM1_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 35)    /* FLEXPWM1_PWM1_OUT_TRIG0_1 output assigned to XBARB3_IN35 input. */
#define IMXRT_XBARB3_IN_FLEXPWM1_PWM2_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 36)    /* FLEXPWM1_PWM2_OUT_TRIG0_1 output assigned to XBARB3_IN36 input. */
#define IMXRT_XBARB3_IN_FLEXPWM1_PWM3_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 37)    /* FLEXPWM1_PWM3_OUT_TRIG0_1 output assigned to XBARB3_IN37 input. */
#define IMXRT_XBARB3_IN_FLEXPWM2_PWM0_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 38)    /* FLEXPWM2_PWM0_OUT_TRIG0_1 output assigned to XBARB3_IN38 input. */
#define IMXRT_XBARB3_IN_FLEXPWM2_PWM1_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 39)    /* FLEXPWM2_PWM1_OUT_TRIG0_1 output assigned to XBARB3_IN39 input. */
#define IMXRT_XBARB3_IN_FLEXPWM2_PWM2_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 40)    /* FLEXPWM2_PWM2_OUT_TRIG0_1 output assigned to XBARB3_IN40 input. */
#define IMXRT_XBARB3_IN_FLEXPWM2_PWM3_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 41)    /* FLEXPWM2_PWM3_OUT_TRIG0_1 output assigned to XBARB3_IN41 input. */
#define IMXRT_XBARB3_IN_FLEXPWM3_PWM0_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 42)    /* FLEXPWM3_PWM0_OUT_TRIG0_1 output assigned to XBARB3_IN42 input. */
#define IMXRT_XBARB3_IN_FLEXPWM3_PWM1_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 43)    /* FLEXPWM3_PWM1_OUT_TRIG0_1 output assigned to XBARB3_IN43 input. */
#define IMXRT_XBARB3_IN_FLEXPWM3_PWM2_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 44)    /* FLEXPWM3_PWM2_OUT_TRIG0_1 output assigned to XBARB3_IN44 input. */
#define IMXRT_XBARB3_IN_FLEXPWM3_PWM3_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 45)    /* FLEXPWM3_PWM3_OUT_TRIG0_1 output assigned to XBARB3_IN45 input. */
#define IMXRT_XBARB3_IN_FLEXPWM4_PWM0_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 46)    /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBARB3_IN46 input. */
#define IMXRT_XBARB3_IN_FLEXPWM4_PWM1_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 47)    /* FLEXPWM4_PWM1_OUT_TRIG0_1 output assigned to XBARB3_IN47 input. */
#define IMXRT_XBARB3_IN_FLEXPWM4_PWM2_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 48)    /* FLEXPWM4_PWM2_OUT_TRIG0_1 output assigned to XBARB3_IN48 input. */
#define IMXRT_XBARB3_IN_FLEXPWM4_PWM3_OUT_TRIG01             IMXRT_XBARB3(XBAR_INPUT, 49)    /* FLEXPWM4_PWM3_OUT_TRIG0_1 output assigned to XBARB3_IN49 input. */
#define IMXRT_XBARB3_IN_GND50                                IMXRT_XBARB3(XBAR_INPUT, 50)    /* GND assigned to XBARB3_IN50 input. */
#define IMXRT_XBARB3_IN_GND51                                IMXRT_XBARB3(XBAR_INPUT, 51)    /* GND assigned to XBARB3_IN51 input. */
#define IMXRT_XBARB3_IN_GND52                                IMXRT_XBARB3(XBAR_INPUT, 52)    /* GND assigned to XBARB3_IN52 input. */
#define IMXRT_XBARB3_IN_GND53                                IMXRT_XBARB3(XBAR_INPUT, 53)    /* GND assigned to XBARB3_IN53 input. */
#define IMXRT_XBARB3_IN_GND54                                IMXRT_XBARB3(XBAR_INPUT, 54)    /* GND assigned to XBARB3_IN54 input. */
#define IMXRT_XBARB3_IN_GND55                                IMXRT_XBARB3(XBAR_INPUT, 55)    /* GND assigned to XBARB3_IN55 input. */
#define IMXRT_XBARB3_IN_GND56                                IMXRT_XBARB3(XBAR_INPUT, 56)    /* GND assigned to XBARB3_IN56 input. */
#define IMXRT_XBARB3_IN_GND57                                IMXRT_XBARB3(XBAR_INPUT, 57)    /* GND assigned to XBARB3_IN57 input. */
#define IMXRT_XBARB3_IN_PIT1_TRIGGER0                        IMXRT_XBARB3(XBAR_INPUT, 58)    /* PIT1_TRIGGER0 output assigned to XBARB3_IN58 input. */
#define IMXRT_XBARB3_IN_PIT1_TRIGGER1                        IMXRT_XBARB3(XBAR_INPUT, 59)    /* PIT1_TRIGGER1 output assigned to XBARB3_IN59 input. */
#define IMXRT_XBARB3_IN_ADC_ETC0_COCO0                       IMXRT_XBARB3(XBAR_INPUT, 60)    /* ADC_ETC0_COCO0 output assigned to XBARB3_IN60 input. */
#define IMXRT_XBARB3_IN_ADC_ETC0_COCO1                       IMXRT_XBARB3(XBAR_INPUT, 61)    /* ADC_ETC0_COCO1 output assigned to XBARB3_IN61 input. */
#define IMXRT_XBARB3_IN_ADC_ETC0_COCO2                       IMXRT_XBARB3(XBAR_INPUT, 62)    /* ADC_ETC0_COCO2 output assigned to XBARB3_IN62 input. */
#define IMXRT_XBARB3_IN_ADC_ETC0_COCO3                       IMXRT_XBARB3(XBAR_INPUT, 63)    /* ADC_ETC0_COCO3 output assigned to XBARB3_IN63 input. */
#define IMXRT_XBARB3_IN_ADC_ETC1_COCO0                       IMXRT_XBARB3(XBAR_INPUT, 64)    /* ADC_ETC1_COCO0 output assigned to XBARB3_IN64 input. */
#define IMXRT_XBARB3_IN_ADC_ETC1_COCO1                       IMXRT_XBARB3(XBAR_INPUT, 65)    /* ADC_ETC1_COCO1 output assigned to XBARB3_IN65 input. */
#define IMXRT_XBARB3_IN_ADC_ETC1_COCO2                       IMXRT_XBARB3(XBAR_INPUT, 66)    /* ADC_ETC1_COCO2 output assigned to XBARB3_IN66 input. */
#define IMXRT_XBARB3_IN_ADC_ETC1_COCO3                       IMXRT_XBARB3(XBAR_INPUT, 67)    /* ADC_ETC1_COCO3 output assigned to XBARB3_IN67 input. */
#define IMXRT_XBARB3_IN_GND68                                IMXRT_XBARB3(XBAR_INPUT, 68)    /* GND assigned to XBARB3_IN68 input. */
#define IMXRT_XBARB3_IN_GND69                                IMXRT_XBARB3(XBAR_INPUT, 69)    /* GND assigned to XBARB3_IN69 input. */
#define IMXRT_XBARB3_IN_GND70                                IMXRT_XBARB3(XBAR_INPUT, 70)    /* GND assigned to XBARB3_IN70 input. */
#define IMXRT_XBARB3_IN_GND71                                IMXRT_XBARB3(XBAR_INPUT, 71)    /* GND assigned to XBARB3_IN71 input. */
#define IMXRT_XBARB3_IN_GND72                                IMXRT_XBARB3(XBAR_INPUT, 72)    /* GND assigned to XBARB3_IN72 input. */
#define IMXRT_XBARB3_IN_GND73                                IMXRT_XBARB3(XBAR_INPUT, 73)    /* GND assigned to XBARB3_IN73 input. */
#define IMXRT_XBARB3_IN_GND74                                IMXRT_XBARB3(XBAR_INPUT, 74)    /* GND assigned to XBARB3_IN74 input. */
#define IMXRT_XBARB3_IN_GND75                                IMXRT_XBARB3(XBAR_INPUT, 75)    /* GND assigned to XBARB3_IN75 input. */
#define IMXRT_XBARB3_IN_QDC1_POSMATCH                        IMXRT_XBARB3(XBAR_INPUT, 76)    /* QDC1_POSMATCH output assigned to XBARB3_IN76 input. */
#define IMXRT_XBARB3_IN_QDC2_POSMATCH                        IMXRT_XBARB3(XBAR_INPUT, 77)    /* QDC2_POSMATCH output assigned to XBARB3_IN77 input. */
#define IMXRT_XBARB3_IN_QDC3_POSMATCH                        IMXRT_XBARB3(XBAR_INPUT, 78)    /* QDC3_POSMATCH output assigned to XBARB3_IN78 input. */
#define IMXRT_XBARB3_IN_QDC4_POSMATCH                        IMXRT_XBARB3(XBAR_INPUT, 79)    /* QDC4_POSMATCH output assigned to XBARB3_IN79 input. */
#define IMXRT_XBARB3_IN_GND80                                IMXRT_XBARB3(XBAR_INPUT, 80)    /* GND assigned to XBARB3_IN80 input. */
#define IMXRT_XBARB3_IN_GND81                                IMXRT_XBARB3(XBAR_INPUT, 81)    /* GND assigned to XBARB3_IN81 input. */
#define IMXRT_XBARB3_IN_EDMA_DONE0                           IMXRT_XBARB3(XBAR_INPUT, 82)    /* EDMA_DONE0 output assigned to XBARB3_IN82 input. */
#define IMXRT_XBARB3_IN_EDMA_DONE1                           IMXRT_XBARB3(XBAR_INPUT, 83)    /* EDMA_DONE1 output assigned to XBARB3_IN83 input. */
#define IMXRT_XBARB3_IN_EDMA_DONE2                           IMXRT_XBARB3(XBAR_INPUT, 84)    /* EDMA_DONE2 output assigned to XBARB3_IN84 input. */
#define IMXRT_XBARB3_IN_EDMA_DONE3                           IMXRT_XBARB3(XBAR_INPUT, 85)    /* EDMA_DONE3 output assigned to XBARB3_IN85 input. */
#define IMXRT_XBARB3_IN_EDMA_DONE4                           IMXRT_XBARB3(XBAR_INPUT, 86)    /* EDMA_DONE4 output assigned to XBARB3_IN86 input. */
#define IMXRT_XBARB3_IN_EDMA_DONE5                           IMXRT_XBARB3(XBAR_INPUT, 87)    /* EDMA_DONE5 output assigned to XBARB3_IN87 input. */
#define IMXRT_XBARB3_IN_EDMA_DONE6                           IMXRT_XBARB3(XBAR_INPUT, 88)    /* EDMA_DONE6 output assigned to XBARB3_IN88 input. */
#define IMXRT_XBARB3_IN_EDMA_DONE7                           IMXRT_XBARB3(XBAR_INPUT, 89)    /* EDMA_DONE7 output assigned to XBARB3_IN89 input. */
#define IMXRT_XBARB3_IN_EDMA_LPSR_DONE0                      IMXRT_XBARB3(XBAR_INPUT, 90)    /* EDMA_LPSR_DONE0 output assigned to XBARB3_IN90 input. */
#define IMXRT_XBARB3_IN_EDMA_LPSR_DONE1                      IMXRT_XBARB3(XBAR_INPUT, 91)    /* EDMA_LPSR_DONE1 output assigned to XBARB3_IN91 input. */
#define IMXRT_XBARB3_IN_EDMA_LPSR_DONE2                      IMXRT_XBARB3(XBAR_INPUT, 92)    /* EDMA_LPSR_DONE2 output assigned to XBARB3_IN92 input. */
#define IMXRT_XBARB3_IN_EDMA_LPSR_DONE3                      IMXRT_XBARB3(XBAR_INPUT, 93)    /* EDMA_LPSR_DONE3 output assigned to XBARB3_IN93 input. */
#define IMXRT_XBARB3_IN_EDMA_LPSR_DONE4                      IMXRT_XBARB3(XBAR_INPUT, 94)    /* EDMA_LPSR_DONE4 output assigned to XBARB3_IN94 input. */
#define IMXRT_XBARB3_IN_EDMA_LPSR_DONE5                      IMXRT_XBARB3(XBAR_INPUT, 95)    /* EDMA_LPSR_DONE5 output assigned to XBARB3_IN95 input. */
#define IMXRT_XBARB3_IN_EDMA_LPSR_DONE6                      IMXRT_XBARB3(XBAR_INPUT, 96)    /* EDMA_LPSR_DONE6 output assigned to XBARB3_IN96 input. */
#define IMXRT_XBARB3_IN_EDMA_LPSR_DONE7                      IMXRT_XBARB3(XBAR_INPUT, 97)    /* EDMA_LPSR_DONE7 output assigned to XBARB3_IN97 input. */
#define IMXRT_XBARB3_IN_GND98                                IMXRT_XBARB3(XBAR_INPUT, 98)    /* GND assigned to XBARB3_IN98 input. */
#define IMXRT_XBARB3_IN_GND99                                IMXRT_XBARB3(XBAR_INPUT, 99)    /* GND assigned to XBARB3_IN99 input. */

/* XBARB3 Mux Output (M Muxes) **********************************************/

#define IMXRT_XBARB3_OUT_AOI2_IN00_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 0)    /* XBARB3_OUT0 output assigned to AOI2_IN00 */
#define IMXRT_XBARB3_OUT_AOI2_IN01_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 1)    /* XBARB3_OUT1 output assigned to AOI2_IN01 */
#define IMXRT_XBARB3_OUT_AOI2_IN02_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 2)    /* XBARB3_OUT2 output assigned to AOI2_IN02 */
#define IMXRT_XBARB3_OUT_AOI2_IN03_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 3)    /* XBARB3_OUT3 output assigned to AOI2_IN03 */
#define IMXRT_XBARB3_OUT_AOI2_IN04_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 4)    /* XBARB3_OUT4 output assigned to AOI2_IN04 */
#define IMXRT_XBARB3_OUT_AOI2_IN05_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 5)    /* XBARB3_OUT5 output assigned to AOI2_IN05 */
#define IMXRT_XBARB3_OUT_AOI2_IN06_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 6)    /* XBARB3_OUT6 output assigned to AOI2_IN06 */
#define IMXRT_XBARB3_OUT_AOI2_IN07_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 7)    /* XBARB3_OUT7 output assigned to AOI2_IN07 */
#define IMXRT_XBARB3_OUT_AOI2_IN08_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 8)    /* XBARB3_OUT8 output assigned to AOI2_IN08 */
#define IMXRT_XBARB3_OUT_AOI2_IN09_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 9)    /* XBARB3_OUT9 output assigned to AOI2_IN09 */
#define IMXRT_XBARB3_OUT_AOI2_IN10_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 10)   /* XBARB3_OUT10 output assigned to AOI2_IN10 */
#define IMXRT_XBARB3_OUT_AOI2_IN11_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 11)   /* XBARB3_OUT11 output assigned to AOI2_IN11 */
#define IMXRT_XBARB3_OUT_AOI2_IN12_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 12)   /* XBARB3_OUT12 output assigned to AOI2_IN12 */
#define IMXRT_XBARB3_OUT_AOI2_IN13_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 13)   /* XBARB3_OUT13 output assigned to AOI2_IN13 */
#define IMXRT_XBARB3_OUT_AOI2_IN14_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 14)   /* XBARB3_OUT14 output assigned to AOI2_IN14 */
#define IMXRT_XBARB3_OUT_AOI2_IN15_SEL_OFFSET                IMXRT_XBARB3(XBAR_OUTPUT, 15)   /* XBARB3_OUT15 output assigned to AOI2_IN15 */

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_XBAR_H */
